<?xml version="1.0" ?>
<net name="tcn" version="10">
	<layers>
		<layer id="0" name="linear.bias1804064" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,40" size="160"/>
			<output>
				<port id="0" names="linear.bias" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="110111054313" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="110211064424" type="Const" version="opset1">
			<data element_type="f32" offset="164" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="110311074019" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="110411084091" type="Const" version="opset1">
			<data element_type="f32" offset="164" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="8518554571" type="Const" version="opset1">
			<data element_type="f32" offset="168" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="8528564556" type="Const" version="opset1">
			<data element_type="f32" offset="172" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="8538574244" type="Const" version="opset1">
			<data element_type="f32" offset="168" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="8548584199" type="Const" version="opset1">
			<data element_type="f32" offset="172" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="8018054055" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="8028064679" type="Const" version="opset1">
			<data element_type="f32" offset="176" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="8038074142" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="8048084181" type="Const" version="opset1">
			<data element_type="f32" offset="176" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="9119153992" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="9129164370" type="Const" version="opset1">
			<data element_type="f32" offset="180" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="9139174250" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="9149184157" type="Const" version="opset1">
			<data element_type="f32" offset="180" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="8318354094" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="8328364259" type="Const" version="opset1">
			<data element_type="f32" offset="184" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="8338374586" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="8348384136" type="Const" version="opset1">
			<data element_type="f32" offset="184" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="7317354535" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="7327364208" type="Const" version="opset1">
			<data element_type="f32" offset="188" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="7337374673" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="7347384025" type="Const" version="opset1">
			<data element_type="f32" offset="188" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="115111554043" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="115211564448" type="Const" version="opset1">
			<data element_type="f32" offset="192" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="115311574001" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="115411584490" type="Const" version="opset1">
			<data element_type="f32" offset="192" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="6316354031" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="6326364655" type="Const" version="opset1">
			<data element_type="f32" offset="196" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="6336373989" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="6346384304" type="Const" version="opset1">
			<data element_type="f32" offset="196" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="109110954433" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="109210964499" type="Const" version="opset1">
			<data element_type="f32" offset="200" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="109310974526" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="109410984358" type="Const" version="opset1">
			<data element_type="f32" offset="200" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="6716754550" type="Const" version="opset1">
			<data element_type="f32" offset="204" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="6726764445" type="Const" version="opset1">
			<data element_type="f32" offset="208" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="6736774217" type="Const" version="opset1">
			<data element_type="f32" offset="204" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="6746784307" type="Const" version="opset1">
			<data element_type="f32" offset="208" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="154515494391" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="154615504202" type="Const" version="opset1">
			<data element_type="f32" offset="212" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="154715514205" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="154815524145" type="Const" version="opset1">
			<data element_type="f32" offset="212" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,320,2"/>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_0/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="176181" type="Const" version="opset1">
			<data element_type="i64" offset="216" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Transpose_0" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="tcn.0.downsample.weight2012228/quantized29034190" type="Const" version="opset1">
			<data element_type="i8" offset="240" shape="32,2,1" size="64"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="tcn.0.downsample.weight2012228/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_15/WithoutBiases/fq_weights_1/zero_point29164109" type="Const" version="opset1">
			<data element_type="f32" offset="304" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_15/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_15/WithoutBiases/fq_weights_1/scale29114286" type="Const" version="opset1">
			<data element_type="f32" offset="432" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_15/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_15/Dims18152034463" type="Const" version="opset1">
			<data element_type="f32" offset="560" shape="1,32,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Add_136" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Add_16/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="148514894361" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="148614903983" type="Const" version="opset1">
			<data element_type="f32" offset="688" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="148714914661" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="148814924133" type="Const" version="opset1">
			<data element_type="f32" offset="688" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="162516294580" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="162616304079" type="Const" version="opset1">
			<data element_type="f32" offset="692" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="162716314052" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="162816324496" type="Const" version="opset1">
			<data element_type="f32" offset="692" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="onnx::Conv_2711832218/quantized28554466" type="Const" version="opset1">
			<data element_type="i8" offset="696" shape="32,2,3" size="192"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="onnx::Conv_2711832218/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_1/WithoutBiases/fq_weights_1/zero_point28684643" type="Const" version="opset1">
			<data element_type="f32" offset="888" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_1/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_1/WithoutBiases/fq_weights_1/scale28634475" type="Const" version="opset1">
			<data element_type="f32" offset="1016" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_1/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="2" pads_end="2" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_1/Dims18991854589" type="Const" version="opset1">
			<data element_type="f32" offset="1144" shape="1,32,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.7" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.11" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Slice_7/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Slice_7/Concat20627475188" type="Const" version="opset1">
			<data element_type="i64" offset="1272" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Slice_7/Concat204820637487189" type="Const" version="opset1">
			<data element_type="i64" offset="1296" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Slice_7/Strides20647547190" type="Const" version="opset1">
			<data element_type="i64" offset="1320" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Slice_7" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0" ellipsis_mask="0,0,0" end_mask="1,1,0" new_axis_mask="0,0,0" shrink_axis_mask="0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_127" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="onnx::Conv_2741922223/quantized26634220" type="Const" version="opset1">
			<data element_type="i8" offset="1344" shape="32,32,3" size="3072"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="onnx::Conv_2741922223/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_8/WithoutBiases/fq_weights_1/zero_point26764493" type="Const" version="opset1">
			<data element_type="f32" offset="4416" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_8/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_8/WithoutBiases/fq_weights_1/scale26714553" type="Const" version="opset1">
			<data element_type="f32" offset="4544" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_8/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="2" pads_end="2" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_8/Dims18691944154" type="Const" version="opset1">
			<data element_type="f32" offset="4672" shape="1,32,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.19" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.23" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Slice_14/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Slice_14/Concat21067535197" type="Const" version="opset1">
			<data element_type="i64" offset="1272" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Slice_14/Concat209221077433198" type="Const" version="opset1">
			<data element_type="i64" offset="1296" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Slice_14/Strides21087640199" type="Const" version="opset1">
			<data element_type="i64" offset="1320" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0" ellipsis_mask="0,0,0" end_mask="1,1,0" new_axis_mask="0,0,0" shrink_axis_mask="0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_135" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Add_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.27" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.31" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Add_32/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="149514994577" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="149615004280" type="Const" version="opset1">
			<data element_type="f32" offset="4800" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="149715014010" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="149815024415" type="Const" version="opset1">
			<data element_type="f32" offset="4800" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="158515894295" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="158615904115" type="Const" version="opset1">
			<data element_type="f32" offset="4804" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="158715914454" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="158815924262" type="Const" version="opset1">
			<data element_type="f32" offset="4804" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="onnx::Conv_2772072230/quantized26874340" type="Const" version="opset1">
			<data element_type="i8" offset="4808" shape="32,32,3" size="3072"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="onnx::Conv_2772072230/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_18/WithoutBiases/fq_weights_1/zero_point27004046" type="Const" version="opset1">
			<data element_type="f32" offset="7880" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_18/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_18/WithoutBiases/fq_weights_1/scale26954076" type="Const" version="opset1">
			<data element_type="f32" offset="8008" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_18/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="4" pads_end="4" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_18/Dims18512094196" type="Const" version="opset1">
			<data element_type="f32" offset="8136" shape="1,32,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.39" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.43" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Slice_24/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Slice_24/Concat21507463212" type="Const" version="opset1">
			<data element_type="i64" offset="1272" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Slice_24/Concat213621517583213" type="Const" version="opset1">
			<data element_type="i64" offset="8264" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Slice_24/Strides21527544214" type="Const" version="opset1">
			<data element_type="i64" offset="1320" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Slice_24" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0" ellipsis_mask="0,0,0" end_mask="1,1,0" new_axis_mask="0,0,0" shrink_axis_mask="0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_146" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="onnx::Conv_2802162235/quantized25674235" type="Const" version="opset1">
			<data element_type="i8" offset="8288" shape="32,32,3" size="3072"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="onnx::Conv_2802162235/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_25/WithoutBiases/fq_weights_1/zero_point25804451" type="Const" version="opset1">
			<data element_type="f32" offset="11360" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Conv_25/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Conv_25/WithoutBiases/fq_weights_1/scale25754247" type="Const" version="opset1">
			<data element_type="f32" offset="11488" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Conv_25/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Conv_25/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="4" pads_end="4" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Conv_25/Dims19052184367" type="Const" version="opset1">
			<data element_type="f32" offset="11616" shape="1,32,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Conv_25" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.51" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Relu_26" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.55" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Slice_31/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Slice_31/Concat21947577221" type="Const" version="opset1">
			<data element_type="i64" offset="1272" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Slice_31/Concat218021957427222" type="Const" version="opset1">
			<data element_type="i64" offset="8264" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Slice_31/Strides21967460223" type="Const" version="opset1">
			<data element_type="i64" offset="1320" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Slice_31" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0" ellipsis_mask="0,0,0" end_mask="1,1,0" new_axis_mask="0,0,0" shrink_axis_mask="0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_154" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Add_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.59" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Relu_33" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.63" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Add_48/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="150515094334" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="150615104634" type="Const" version="opset1">
			<data element_type="f32" offset="11744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="150715114670" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="150815124379" type="Const" version="opset1">
			<data element_type="f32" offset="11744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="159515994439" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="146" name="159616004172" type="Const" version="opset1">
			<data element_type="f32" offset="11748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="147" name="159716014004" type="Const" version="opset1">
			<data element_type="f32" offset="160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="148" name="159816024034" type="Const" version="opset1">
			<data element_type="f32" offset="11748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="149" name="onnx::Conv_2832272240/quantized29274121" type="Const" version="opset1">
			<data element_type="i8" offset="11752" shape="32,32,3" size="3072"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="onnx::Conv_2832272240/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="Conv_34/WithoutBiases/fq_weights_1/zero_point29404640" type="Const" version="opset1">
			<data element_type="f32" offset="14824" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="Conv_34/WithoutBiases/fq_weights_1/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="Conv_34/WithoutBiases/fq_weights_1/scale29354169" type="Const" version="opset1">
			<data element_type="f32" offset="14952" shape="32,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="Conv_34/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="Conv_34/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="4" pads_begin="8" pads_end="8" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="Conv_34/Dims18392294073" type="Const" version="opset1">
			<data element_type="f32" offset="15080" shape="1,32,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="Conv_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.71" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="Relu_35" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.75" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="Slice_40/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="Slice_40/Concat22387472232" type="Const" version="opset1">
			<data element_type="i64" offset="1272" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="Slice_40/Concat222422397478233" type="Const" version="opset1">
			<data element_type="i64" offset="15208" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="162" name="Slice_40/Strides22407529234" type="Const" version="opset1">
			<data element_type="i64" offset="1320" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="163" name="Slice_40" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0" ellipsis_mask="0,0,0" end_mask="1,1,0" new_axis_mask="0,0,0" shrink_axis_mask="0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_164" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="164" name="onnx::Conv_2862362245/quantized27834481" type="Const" version="opset1">
