<?xml version="1.0" ?>
<net name="tcn" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 320, 2"/>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="linear.bias" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1, 1, 40" size="160"/>
			<output>
				<port id="0" names="linear.bias" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="176" type="Const" version="opset1">
			<data element_type="i64" offset="160" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Transpose_0" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="onnx::Conv_271" type="Const" version="opset1">
			<data element_type="f32" offset="184" shape="32, 2, 3" size="768"/>
			<output>
				<port id="0" names="onnx::Conv_271" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="2" pads_end="2" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_1/Dims1899" type="Const" version="opset1">
			<data element_type="f32" offset="952" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.7" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.11" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Slice_7/Concat20627475" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Slice_7/Concat204820637487" type="Const" version="opset1">
			<data element_type="i64" offset="1104" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Slice_7/Strides20647547" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Slice_7" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_127" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="onnx::Conv_274" type="Const" version="opset1">
			<data element_type="f32" offset="1152" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_274" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="2" pads_end="2" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_8/Dims1869" type="Const" version="opset1">
			<data element_type="f32" offset="13440" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.19" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.23" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Slice_14/Concat21067535" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Slice_14/Concat209221077433" type="Const" version="opset1">
			<data element_type="i64" offset="1104" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Slice_14/Strides21087640" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>322</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_135" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="tcn.0.downsample.weight" type="Const" version="opset1">
			<data element_type="f32" offset="13568" shape="32, 2, 1" size="256"/>
			<output>
				<port id="0" names="tcn.0.downsample.weight" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_15/Dims1815" type="Const" version="opset1">
			<data element_type="f32" offset="13824" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="onnx::Add_136" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Add_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.27" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.31" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx::Conv_277" type="Const" version="opset1">
			<data element_type="f32" offset="13952" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_277" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="4" pads_end="4" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_18/Dims1851" type="Const" version="opset1">
			<data element_type="f32" offset="26240" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.39" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.43" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Slice_24/Concat21507463" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Slice_24/Concat213621517583" type="Const" version="opset1">
			<data element_type="i64" offset="26368" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Slice_24/Strides21527544" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Slice_24" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_146" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_280" type="Const" version="opset1">
			<data element_type="f32" offset="26392" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_280" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_25/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="4" pads_end="4" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_25/Dims1905" type="Const" version="opset1">
			<data element_type="f32" offset="38680" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_25" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.51" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Relu_26" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.55" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Slice_31/Concat21947577" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Slice_31/Concat218021957427" type="Const" version="opset1">
			<data element_type="i64" offset="26368" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Slice_31/Strides21967460" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Slice_31" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>324</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_154" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Add_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.59" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Relu_33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.63" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx::Conv_283" type="Const" version="opset1">
			<data element_type="f32" offset="38808" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_283" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_34/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="4" pads_begin="8" pads_end="8" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_34/Dims1839" type="Const" version="opset1">
			<data element_type="f32" offset="51096" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.71" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Relu_35" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.75" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Slice_40/Concat22387472" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Slice_40/Concat222422397478" type="Const" version="opset1">
			<data element_type="i64" offset="51224" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Slice_40/Strides22407529" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Slice_40" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_164" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Conv_286" type="Const" version="opset1">
			<data element_type="f32" offset="51248" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_286" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="4" pads_begin="8" pads_end="8" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_41/Dims1875" type="Const" version="opset1">
			<data element_type="f32" offset="63536" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.83" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Relu_42" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.87" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Slice_47/Concat22827403" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Slice_47/Concat226822837466" type="Const" version="opset1">
			<data element_type="i64" offset="51224" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Slice_47/Strides22847619" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Slice_47" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>328</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_172" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Add_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.91" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Relu_49" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.95" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="onnx::Conv_289" type="Const" version="opset1">
			<data element_type="f32" offset="63664" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_289" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_50/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="8" pads_begin="16" pads_end="16" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_50/Dims1893" type="Const" version="opset1">
			<data element_type="f32" offset="75952" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_50" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.103" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Relu_51" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.107" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Slice_56/Concat23267490" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Slice_56/Concat231223277514" type="Const" version="opset1">
			<data element_type="i64" offset="76080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Slice_56/Strides23287424" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Slice_56" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_182" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx::Conv_292" type="Const" version="opset1">
			<data element_type="f32" offset="76104" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_292" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="8" pads_begin="16" pads_end="16" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_57/Dims1911" type="Const" version="opset1">
			<data element_type="f32" offset="88392" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.115" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Relu_58" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.119" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Slice_63/Concat23707409" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Slice_63/Concat235623717622" type="Const" version="opset1">
			<data element_type="i64" offset="76080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Slice_63/Strides23727436" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Slice_63" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_190" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Add_64" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.123" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Relu_65" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.127" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="onnx::Conv_295" type="Const" version="opset1">
			<data element_type="f32" offset="88520" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_295" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_66/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="16" pads_begin="32" pads_end="32" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_66/Dims1881" type="Const" version="opset1">
			<data element_type="f32" offset="100808" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_66" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.135" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Relu_67" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.139" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Slice_72/Concat24147430" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Slice_72/Concat240024157484" type="Const" version="opset1">
			<data element_type="i64" offset="100936" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Slice_72/Strides24167553" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Slice_72" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_200" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="onnx::Conv_298" type="Const" version="opset1">
			<data element_type="f32" offset="100960" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_298" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_73/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="16" pads_begin="32" pads_end="32" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_73/Dims1863" type="Const" version="opset1">
			<data element_type="f32" offset="113248" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_73" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.147" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_74" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.151" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Slice_79/Concat24587616" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Slice_79/Concat244424597613" type="Const" version="opset1">
			<data element_type="i64" offset="100936" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Slice_79/Strides24607445" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Slice_79" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_208" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Add_80" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.155" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Relu_81" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.159" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="onnx::Conv_301" type="Const" version="opset1">
			<data element_type="f32" offset="113376" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_301" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_82/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="32" pads_begin="64" pads_end="64" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_82/Dims1821" type="Const" version="opset1">
			<data element_type="f32" offset="125664" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_82" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.167" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Relu_83" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.171" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Slice_88/Concat25027511" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Slice_88/Concat248825037496" type="Const" version="opset1">
			<data element_type="i64" offset="125792" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Slice_88/Strides25047493" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Slice_88" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Conv_218" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="onnx::Conv_304" type="Const" version="opset1">
			<data element_type="f32" offset="125816" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_304" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_89/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="32" pads_begin="64" pads_end="64" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_89/Dims1887" type="Const" version="opset1">
			<data element_type="f32" offset="138104" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_89" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.179" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Relu_90" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.183" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Slice_95/Concat25467631" type="Const" version="opset1">
			<data element_type="i64" offset="1080" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Slice_95/Concat253225477607" type="Const" version="opset1">
			<data element_type="i64" offset="125792" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Slice_95/Strides25487571" type="Const" version="opset1">
			<data element_type="i64" offset="1128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Slice_95" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="onnx::Add_226" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Add_96" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.187" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Relu_97" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="input.191" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="onnx::Conv_307" type="Const" version="opset1">
			<data element_type="f32" offset="138232" shape="32, 32, 3" size="12288"/>
			<output>
				<port id="0" names="onnx::Conv_307" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Conv_98/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="64" pads_begin="128" pads_end="128" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Conv_98/Dims1827" type="Const" version="opset1">
			<data element_type="f32" offset="150520" shape="1, 32, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Conv_98" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="input.199" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
